jjacke13/hyperdht-cpp/examples/esp32/sdkconfig.defaults
# ESP32-S3 target
CONFIG_IDF_TARGET="esp32s3"

# lwIP tuning for HyperDHT
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_MAX_SOCKETS=16

# PSRAM (ESP32-S3 with octal PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# Stack size for main task (networking + crypto)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
